spacemacs.org
#+SETUPFILE: .setup
#+TITLE: Spacemacs
#+DESCRIPTION: Why not taking adventage of the community?

#+BEGIN_PREVIEW
My current setup for my emacs, with spacemacs.
#+END_PREVIEW

#+TOC: headlines 3

* Tasks                                                            :noexport:
** TODO Tweaking Emacs Settings
:LOGBOOK:
CLOCK: [2017-08-22 Tue 15:11]--[2017-08-22 Tue 16:39] =>  1:28
CLOCK: [2017-08-21 Mon 14:30]--[2017-08-21 Mon 14:49] =>  0:19
:END:
** TODO benckmark the init process
Take a look at [[http://oremacs.com/2015/02/24/emacs-speed-test/][this]].
** TODO Check these out
- [ ][[https://www.emacswiki.org/emacs/OneOnOneEmacs][EmacsWiki: One On One Emacs]]
- [ ][[https://www.emacswiki.org/emacs/FrameModes][EmacsWiki: Frame Modes]]
** TODO snippets
reference [[https://github.com/syl20bnr/spacemacs/blob/c788da709bb1c74344f5ab1b6f18cfdf6b930df8/layers/%252Bcompletion/auto-completion/packages.el][here]].
** Easy Templates
[[http://orgmode.org/manual/Easy-Templates.html][This]] is a very time saving cheatsheet.


** CANCELLED Writing with org-mode and hexo
CLOSED: [2017-08-23 Wed 10:15]
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2017-08-23 Wed 10:15] \\
  I use gatsbyjs now
:END:
** CANCELLED map C-h to SPC-h
CLOSED: [2017-02-08 Wed 14:41]
:LOGBOOK:
- State "CANCELLED"  from "TODO"       [2017-02-08 Wed 14:41] \\
  the current solution is good enough
:END:
** DONE publish org notes as whole
CLOSED: [2017-09-14 Thu 11:22]
** DONE setup syntax checking
CLOSED: [2017-01-22 Sun 12:23]
For javascript, react.js and es6 stuff. check [[http://codewinds.com/blog/2015-04-02-emacs-flycheck-eslint-jsx.html][here]].
** DONE remove org src temp file
CLOSED: [2017-01-22 Sun 12:57]
=command+s= still saves the buffer
** DONE prefix p, to counsel-projectile if not in a project
CLOSED: [2017-01-23 Mon 14:16]
* Background
The setup is inspired by [[http://www.modernemacs.com/post/migrate-layers/][this]] article. The basic idea is to organize my own
setup code into a private =spacemacs layer=. Simply because I don't want to have
a gigantic =.spacemacs= file, nor tons of =(load-file ...)= in it. Gonna do it
the spacemacs way. Nice and clean.

This whole org file is the source code of my setup. I simply tangle the
necessary code blocks into the right place, then magic happens.

* Install Spacemacs
:PROPERTIES:
:dir:      ~/
:END:

The last time I checked, this still works. I don't think it's going to change
any time soon. But just in case, check the [[https://github.com/syl20bnr/spacemacs][official document]].

#+BEGIN_SRC sh
 git clone https://github.com/syl20bnr/spacemacs ~/.emacs.d 
#+END_SRC

* Spacemacs Init File
:PROPERTIES:
:header-args: :tangle .dist/emacs/.spacemacs.d/init.el :mkdirp yes
:END:

This section is the content of file =~/.spacemacs.d/init.el=.

** Layers

I categorize my layers into the following categories.
*** Core Layers
The basic ones.
#+NAME: org-mode-layer-core
#+BEGIN_SRC emacs-lisp :tangle no
  better-defaults
  ivy
  auto-completion
  git
  ;; (shell :variables
  ;;        shell-default-height 30
  ;;        shell-default-position 'bottom)
  spell-checking
  syntax-checking
  version-control
  emoji
  deft
  osx
  finance
  csv
  pandoc
  (org :variables
       org-enable-org-journal-support t
       org-enable-hugo-support t
       org-enable-github-support t
       org-projectile-file (concat org-directory "/projects.org")
       org-enable-reveal-js-support t)
#+END_SRC

*** Programming Languages
The ones that help my writing code.
#+NAME: org-mode-layer-lang
#+BEGIN_SRC emacs-lisp :tangle no
  emacs-lisp
  swift
  html
  javascript
  markdown
  ruby
  graphviz
  yaml
  shell-scripts
  react
  windows-scripts
  java
  rust
  python
#+END_SRC

*** Local Layers
My local layers, currently only has one for all my customization.
#+NAME: org-mode-layer-local
#+BEGIN_SRC emacs-lisp :tangle no
  (config
   :location local)
#+END_SRC

*** Config the Layers
Config the spacemacs layers. Include all the layers above.
#+BEGIN_SRC emacs-lisp :noweb yes
  (defun dotspacemacs/layers ()
    "Configuration Layers declaration.
  You should not put any user code in this function besides modifying the variable
  values."
    (setq-default
     dotspacemacs-distribution 'spacemacs
     dotspacemacs-enable-lazy-installation 'unused
     dotspacemacs-ask-for-lazy-installation t
     dotspacemacs-configuration-layer-path '()
     dotspacemacs-configuration-layers
     '(
       <<org-mode-layer-core>>
       <<org-mode-layer-lang>>
       <<org-mode-layer-local>>
       )
     dotspacemacs-additional-packages '()
     dotspacemacs-frozen-packages '()
     dotspacemacs-excluded-packages '()
     dotspacemacs-install-packages 'used-only))
#+END_SRC

