spacemacs.org
** The Basic Vars
Some basic var defs.

#+NAME: org-mode-vars
#+BEGIN_SRC emacs-lisp 
  (setq org-directory "~/io"
        org-log-into-drawer 1
        org-default-notes-file (concat org-directory "/inbox.org")
        org-agenda-files (list org-directory
                               (concat org-directory "/notes")
                               (concat org-directory "/work")
                               (concat org-directory "/projects"))
        org-log-done t
        org-startup-with-inline-images t
        org-image-actual-width nil
        org-startup-indented t
        org-html-htmlize-output-type 'css
        org-html-doctype "html5"
        org-html-metadata-timestamp-format "%Y %b %d (%a)"
        )
#+END_SRC

** Clocking
About clocking.
#+NAME: org-mode-clocking
#+BEGIN_SRC emacs-lisp
  (setq org-clock-persist t
        org-clock-persist-query-resume nil
        org-clock-out-remove-zero-time-clocks t)
  (org-clock-persistence-insinuate)
#+END_SRC
** "TODO" Keywords
My setup of the "TODO" keywords.
#+NAME: org-mode-todo
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keywords
        (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
                (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")
                )))

  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "red" :weight bold)
                ("IDEA" :foreground "red" :weight bold)
                ("NEXT" :foreground "deep sky blue" :weight bold)
                ("DRAFT" :foreground "deep sky blue" :weight bold)
                ("DONE" :foreground "forest green" :weight bold)
                ("WAITING" :foreground "orange" :weight bold)
                ("HOLD" :foreground "magenta" :weight bold)
                ("PUBLISHED" :foreground "forest green" :weight bold)
                ("CANCELLED" :foreground "forest green" :weight bold))))

#+END_SRC
** Agenda
My customized agenda commands.
#+NAME: org-mode-agenda
#+BEGIN_SRC emacs-lisp
  (setq org-agenda-custom-commands
        '((" " "Home"
           ((agenda "" nil)
            (todo "NEXT"
                  ((org-agenda-overriding-header "NEXT")))
            (todo "TODO"
                  ((org-agenda-overriding-header "PROJECTS")
                   (org-agenda-files (file-expand-wildcards "~/io/projects/*.org"))
                   (org-agenda-sorting-strategy '(todo-state-up))
                   ))
            (todo "TODO"
                  ((org-agenda-overriding-header "NOTES")
                   (org-agenda-files (file-expand-wildcards "~/io/notes/*.org"))
                   (org-agenda-sorting-strategy '(todo-state-up))
                   ))
            (todo "WAITING|HOLD"
                  ((org-agenda-overriding-header "PENDING")
                   (org-agenda-sorting-strategy '(todo-state-up))
                   ))
            ))
          ("Q" . "Custom Queries")
          ("Qn" "Note Search" search ""
           ((org-agenda-files (file-expand-wildcards "~/io/notes/*.org"))))
          ("w" "Writing"
           ((agenda "")
            (todo "DRAFT" ((org-agenda-overriding-header "Drafts")))
            (todo "IDEA" ((org-agenda-overriding-header "Ideas")))))))
#+END_SRC

** Capture

#+BEGIN_SRC text :tangle .dist/emacs/.emacs.d/templates/note.txt :mkdirp yes
       ,* %^{description}
       :LOGBOOK:
       - Added: %U
       :END:

       %?
#+END_SRC

#+BEGIN_SRC text :tangle .dist/emacs/.emacs.d/templates/todo.txt :mkdirp yes
       ,* TODO %?
       :LOGBOOK:
       - Added: %U
       :END:
#+END_SRC

#+BEGIN_SRC text :tangle .dist/emacs/.emacs.d/templates/link.txt :mkdirp yes
       ,* %?
       :LOGBOOK:
       - Added: %U
       :END:
       %^L
#+END_SRC

#+NAME: org-mode-capture
#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
        `(("t" "todo" entry
           (file+headline ,(concat org-directory "/desktop.org") "Inbox")
           (file , "~/.emacs.d/templates/todo.txt")
           ::empty-lines-before 1
           ::empty-lines-after 1)
          ("n" "note" entry
           (file+headline ,(concat org-directory "/desktop.org") "Quick Notes")
           (file , "~/.emacs.d/templates/note.txt")
           ::empty-lines-before 1
           ::empty-lines-after 1)
          ("l" "link" entry
           (file+headline ,(concat org-directory "/desktop.org") "Inbox")
           (file , "~/.emacs.d/templates/link.txt")
           ::empty-lines-before 1
           ::empty-lines-after 1)
          ))
#+END_SRC

** Archive
About archiving behaviour.
#+NAME: org-mode-archive
#+BEGIN_SRC emacs-lisp
  (setq org-archive-mark-done nil)
  (setq org-archive-location "%s_archive::* Archived Tasks")
#+END_SRC
** Export

#+NAME: org-mode-export
#+BEGIN_SRC emacs-lisp
  (require 'ox-man)
#+END_SRC
** Babel
Babel setup, super important because I use literate programming *A LOT*.
#+NAME: org-mode-babel
#+BEGIN_SRC emacs-lisp
  (require 'ob)
  (require 'ob-shell)
  (require 'ob-ruby)
  (require 'ob-python)
  (require 'ob-sass)
  (require 'ob-tangle)
  (setq org-src-fontify-natively t)
  (setq org-confirm-babel-evaluate nil)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (emacs-lisp . t)
     (shell . t)
     (ruby . t)
     (sass . t)
     (dot . t)
     (java . t)
     ))
  (defun org-babel-execute:yaml (body params) body)

#+END_SRC
** Publishing
This is about publishing my org files, generate a beautiful website. Sit tight!

Take a look at this someday: [[https://github.com/fniessen/org-html-themes][GitHub - fniessen/org-html-themes: How to export Org mode files into awesome HTML in 2 minutes]] 

*** Handy functions for publish

#+NAME: org-mode-publishing-funcs
#+BEGIN_SRC emacs-lisp :noweb yes
  (defun x/publish-src(x)
    (get-string-from-file (format "%s/.publish/dist/%s" org-directory x)))

  (defun x/publish-path (path)
    (concat x/org-publish-root path))

  (defun x/org-src (path)
    (concat org-directory path))

  (defun x/org-get-preview (file project)
    "Get the preview text of file."
    (let ((file (org-publish--expand-file-name file project)))
      (with-temp-buffer
        (insert-file-contents file)
        (goto-char (point-min))
        (let ((loc (re-search-forward "^#\\+BEGIN_PREVIEW$" nil t)))
          (when loc
            (goto-char loc)
            (let ((beg (org-element-property :contents-begin (org-element-at-point)))
                  (end (org-element-property :contents-end (org-element-at-point))))
              (buffer-substring beg end))
            )))))

  (defun x/org-publish-sitemap (title list)
    "site map, as a string.
  TITLE is the the title of the site map.  LIST is an internal
  representation for the files to include, as returned by
  `org-list-to-lisp'.  PROJECT is the current project."
    (concat "#+SETUPFILE: .setup" "\n"
            "#+EXPORT_FILE_NAME: index.html" "\n"
            "#+TITLE: " title "\n\n"
            "#+HTML: <div class=\"index\">" "\n"
            (org-list-to-subtree list)
            "#+HTML: </div>"))

  <<org-publish-sitemap-entry-format-post>>
  <<org-publish-sitemap-entry-format-note>>
  <<org-publish-sitemap-entry-format-setup>>

  (defun x/org-publish-sitemap-entry-post (entry style project)
    (x/org-publish-sitemap-entry
     entry style project
     x/org-publish-sitemap-entry-format-post))

  (defun x/org-publish-sitemap-entry-note (entry style project)
    (x/org-publish-sitemap-entry
     entry style project
     x/org-publish-sitemap-entry-format-note))

  (defun x/org-publish-sitemap-entry-setup (entry style project)
    (x/org-publish-sitemap-entry
     entry style project
     x/org-publish-sitemap-entry-format-setup))

  (defun x/org-publish-sitemap-entry (entry style project fmt)
    (cond ((not (directory-name-p entry))
           (format-spec
            fmt
            `((?t . ,(org-publish-find-title entry project))
              (?d . ,(format-time-string "%Y-%m-%d" (org-publish-find-date entry project)))
              (?p . ,(org-publish-find-property entry :description project 'html))
              (?f . ,entry))))
          ((eq style 'tree)
           ;; Return only last subdir.
           (file-name-nondirectory (directory-file-name entry)))
          (t entry)))
#+END_SRC

#+RESULTS: org-mode-publishing-funcs
: x/sitemap-entry-format-posts

