spacemacs.org
*** POC                                                          :noexport:
#+BEGIN_SRC emacs-lisp
  (defun x/org-publish-sitemap (project entry-format &optional sitemap-filename)
    "Generate the sitemap for my blog."
    (let* ((project-plist (cdr project))
           (dir (file-name-as-directory
                 (plist-get project-plist :base-directory)))
           (localdir (file-name-directory dir))
           (exclude-regexp (plist-get project-plist :exclude))
           (files (nreverse
                   (org-publish-get-base-files project exclude-regexp)))
           (sitemap-filename (concat dir (or sitemap-filename "sitemap.org")))
           (sitemap-sans-extension
            (plist-get project-plist :sitemap-sans-extension))
           (visiting (find-buffer-visiting sitemap-filename))
           file sitemap-buffer)
      (with-current-buffer
          (let ((org-inhibit-startup t))
            (setq sitemap-buffer
                  (or visiting (find-file sitemap-filename))))
        (erase-buffer)
        ;; (insert "#+SETUPFILE: .setup")
        ;; loop through all of the files in the project
        (while (setq file (pop files))
          (let ((fn (file-name-nondirectory file))
                (link file)
                ;; (link ;; changed this to fix links. see postprocessor.
                ;;  (file-relative-name file (file-name-as-directory
                ;;                            (expand-file-name (concat (file-name-as-directory dir) "..")))))
                (oldlocal localdir))
            (when sitemap-sans-extension
              (setq link (file-name-sans-extension link)))
            ;; sitemap shouldn't list itself
            (unless (equal (file-truename "index.org")
                           (file-truename file))
              (let (;; get the title and date of the current file
                    (title (org-publish-format-file-entry "%t" file project-plist))
                    (date (org-publish-format-file-entry "%d" file project-plist))
                    ;; get the preview section from the current file
                    (preview (x/org-get-preview file))
                    (regexp "\\(.*\\)\\[\\([^][]+\\)\\]\\(.*\\)"))
                ;; insert a horizontal line before every post, kill the first one
                ;; before saving
                (let ((entry
                       (x/org-publish-format-file-entry
                        org-publish-sitemap-file-entry-format file project-plist)))
                  (insert entry))
                ;; (insert (funcall entry-format title fn date preview))
                ;; (insert "-----\n")
                ;; (cond ((string-match-p regexp title)
                ;;        (string-match regexp title)
                ;;        ;; insert every post as headline
                ;;        (insert (concat"* " (match-string 1 title)
                ;;                       "[[file:" fn "]["
                ;;                       (match-string 2 title)
                ;;                       "]]" (match-string 3 title) "\n")))
                ;;       (t (insert (concat "* [[file:" fn "][" title "]]\n"))))
                ;; ;; add properties for `ox-rss.el' here
                ;; (let ((rss-permalink (concat (file-name-sans-extension link) ".html"))
                ;;       (rss-pubdate (format-time-string
                ;;                     (car org-time-stamp-formats)
                ;;                     (org-publish-find-date file))))
                ;;   ;; (org-set-property "RSS_PERMALINK" rss-permalink)
                ;;   (org-set-property "PUBDATE" rss-pubdate))
                ;; ;; insert the date, preview, & read more link
                ;; (insert (concat date "\n\n"))
                ;; (insert preview)
                ;; (insert (concat "[[file:" fn "][Read More...]]\n"))
                ))))
        ;; kill the first hrule to make this look OK
        (goto-char (point-min))
        (let ((kill-whole-line t)) (kill-line))
        (save-buffer))
      (or visiting (kill-buffer sitemap-buffer))))

  (defun x/org-publish-org-sitemap (project &optional sitemap-filename)
    "Create a sitemap of pages in set defined by PROJECT.
    Optionally set the filename of the sitemap with SITEMAP-FILENAME.
    Default for SITEMAP-FILENAME is `sitemap.org'."
    (let* ((project-plist (cdr project))
           (dir (file-name-as-directory
                 (plist-get project-plist :base-directory)))
           (localdir (file-name-directory dir))
           (indent-str (make-string 2 ?\s))
           (exclude-regexp (plist-get project-plist :exclude))
           (files (nreverse
                   (org-publish-get-base-files project exclude-regexp)))
           (sitemap-filename (concat dir (or sitemap-filename "sitemap.org")))
           (sitemap-title (or (plist-get project-plist :sitemap-title)
                              (concat "Sitemap for project " (car project))))
           (sitemap-style (or (plist-get project-plist :sitemap-style)
                              'tree))
           (sitemap-sans-extension
            (plist-get project-plist :sitemap-sans-extension))
           (visiting (find-buffer-visiting sitemap-filename))
           (sitemap-format-entry (plist-get project-plist :sitemap-format-entry))
           file sitemap-buffer)
      (with-current-buffer
          (let ((org-inhibit-startup t))
            (setq sitemap-buffer
                  (or visiting (find-file sitemap-filename))))
        (erase-buffer)
        (insert "#+SETUPFILE: .setup\n")
        (insert (concat "#+TITLE: " sitemap-title "\n\n"))
        (while (setq file (pop files))
          (let ((link (file-relative-name file dir))
                (oldlocal localdir))
            (when sitemap-sans-extension
              (setq link (file-name-sans-extension link)))
            ;; sitemap shouldn't list itself
            (unless (file-equal-p sitemap-filename file)
              ;; This is common to 'flat and 'tree
              (let ((entry
                     (x/org-publish-format-file-entry
                      (funcall sitemap-format-entry) file link project-plist))
                    (regexp "\\(.*\\)\\[\\([^][]+\\)\\]\\(.*\\)"))
                (insert entry)
                ))))
        (save-buffer))
      (or visiting (kill-buffer sitemap-buffer))))
#+END_SRC

*** Home
This is the home page and all the other stuff.
#+NAME: org-mode-publishing-home
#+BEGIN_SRC emacs-lisp
  ("home"
   :base-directory ,(x/org-src "/")
   :base-extension "org"
   :publishing-directory ,(x/publish-path "/")
   :publishing-function org-html-publish-to-html
   :exclude "inbox.org"   ;; regexp
   :headline-levels 3

   :with-todo-keywords nil
   :section-numbers nil
   :html-head ,(x/publish-src "head.html")
   :html-preamble t
   :html-postamble t
   :with-toc nil)

#+END_SRC

*** Notes
The =Notes= category.

#+NAME: org-publish-sitemap-entry-format-note
#+BEGIN_SRC emacs-lisp
  (setq x/org-publish-sitemap-entry-format-note
        (mapconcat
         'identity
         '("[[file:%f][%t]]"
           "") "\n"))
#+END_SRC

#+NAME: org-mode-publishing-notes
#+BEGIN_SRC emacs-lisp
  ("notes"
   :base-directory ,(x/org-src "/notes/")
   :base-extension "org"
   :publishing-directory ,(x/publish-path "/notes/")
   :publishing-function org-html-publish-to-html
   ;; :exclude "PrivatePage.org"   ;; regexp

   ;; sitemap
   :auto-sitemap t
   :sitemap-title "Notes"
   :sitemap-function x/org-publish-sitemap
   :sitemap-date-format "Published: %a %b %d %Y"
   :sitemap-sort-files anti-chronologically
   :sitemap-format-entry x/org-publish-notes-sitemap-entry
   :sitemap-filename ".index.org"

   :html-head ,(x/publish-src "head.html")
   :html-preamble t
   :html-postamble t)
#+END_SRC
*** Posts
The =Posts= category.

Site map format.
#+NAME: org-publish-sitemap-entry-format-post
#+BEGIN_SRC emacs-lisp
  (setq x/org-publish-sitemap-entry-format-post
        (mapconcat
         'identity
         '("[[file:%f][%t]] [%d]"
           "%p"
           "") "\n"))
#+END_SRC

#+NAME: org-mode-publishing-posts
#+BEGIN_SRC emacs-lisp
  ("posts"
   :base-directory ,(x/org-src "/posts/")
   :base-extension "org"
   :exclude "^\\..+"
   :publishing-directory ,(x/publish-path "/posts/")
   :publishing-function org-html-publish-to-html

   ;; sitemap
   :auto-sitemap t
   :sitemap-title "Posts"
   :sitemap-function x/org-publish-sitemap
   :sitemap-date-format "%Y %b %d (%a)"
   :sitemap-sort-files anti-chronologically
   ;; :sitemap-format-entry x/sitemap-entry-format-posts
   :sitemap-format-entry x/org-publish-sitemap-entry-post
   :sitemap-filename ".index.org"

   :html-head ,(x/publish-src "head.html")
   :html-preamble t
   :html-postamble t)
#+END_SRC

*** COMMENT Projects
My =Projects=.
#+NAME: org-mode-publishing-projects
#+BEGIN_SRC emacs-lisp
  ("projects"
   :base-directory ,(x/org-src "/projects/")
   :base-extension "org"
   :exclude "^\\..+"
   :publishing-directory ,(x/publish-path "/projects/")
   :publishing-function org-html-publish-to-html

   ;; sitemap
   :auto-sitemap t
   :sitemap-title "Projects"
   ;:sitemap-function x/org-publish-org-sitemap
   :sitemap-date-format "%a %b %d %Y"
   :sitemap-sort-files anti-chronologically
   ;; :sitemap-format-entry x/sitemap-entry-format-notes
   :sitemap-filename ".index.org"

   :html-head ,(x/publish-src "head.html")
   :html-preamble t
   :html-postamble t)
#+END_SRC

*** Setup

#+NAME: org-publish-sitemap-entry-format-setup
#+BEGIN_SRC emacs-lisp
  (setq x/org-publish-sitemap-entry-format-setup
        (mapconcat
         'identity
         '("[[file:%f][%t]]"
           "%p"
           "") "\n"))
#+END_SRC

#+NAME: org-mode-publishing-setup
#+BEGIN_SRC emacs-lisp
  ("setup"
   :base-directory ,(x/org-src "/setup/")
   :base-extension "org"
   :publishing-directory ,(x/publish-path "/setup/")
   :publishing-function org-html-publish-to-html

   ;; sitemap
   :auto-sitemap t
   :sitemap-title "My Setup"
   :sitemap-function x/org-publish-sitemap
   :sitemap-date-format "%a %b %d %Y"
   ;; :sitemap-sort-files anti-chronologically
   :sitemap-format-entry x/org-publish-sitemap-entry-setup
   :sitemap-filename ".index.org"

   :html-head ,(x/publish-src "head.html")
   :html-preamble t
   :html-postamble t)
#+END_SRC

*** Resources
All the necessary style file and javascript.
#+NAME: org-mode-publishing-res
#+BEGIN_SRC emacs-lisp
  ("res"
   :base-directory ,(x/org-src "/.publish/dist/")
   :base-extension "css\\|js\\|svg"
   :recursive t
   :publishing-directory ,(x/publish-path "/")
   :publishing-function org-publish-attachment)
#+END_SRC
*** The publish setup
This is the whole setup.
#+NAME: org-mode-publishing
#+BEGIN_SRC emacs-lisp :noweb yes
  <<org-mode-publishing-funcs>>
  (setq org-html-preamble-format `(("en" ,(x/publish-src "preamble.html"))))
  (setq org-html-postamble-format `(("en" ,(x/publish-src "postamble.html"))))

  (setq org-publish-project-alist
        `(
          <<org-mode-publishing-home>>
          <<org-mode-publishing-notes>>
          <<org-mode-publishing-posts>>
          <<org-mode-publishing-projects>>
          <<org-mode-publishing-setup>>
          <<org-mode-publishing-res>>

          ("images"
           :base-directory ,(x/org-src "/img/")
           :base-extension "jpg\\|gif\\|png"
           :publishing-directory ,(x/publish-path "/images/")
           :publishing-function org-publish-attachment)

          ("website" :components ("home" "posts" "setup" "images" "res"))))
#+END_SRC

