.dist/src/.spacemacs.d/layers/config/packages.el
           :exclude "inbox.org"   ;; regexp
           :headline-levels 3
          
           :with-todo-keywords nil
           :section-numbers nil
           :html-head ,(x/publish-src "head.html")
           :html-preamble t
           :html-postamble t
           :with-toc nil)
          
          ("notes"
           :base-directory ,(x/org-src "/notes/")
           :base-extension "org"
           :publishing-directory ,(x/publish-path "/notes/")
           :publishing-function org-html-publish-to-html
           ;; :exclude "PrivatePage.org"   ;; regexp
          
           ;; sitemap
           :auto-sitemap t
           :sitemap-title "Notes"
           :sitemap-function x/org-publish-sitemap
           :sitemap-date-format "Published: %a %b %d %Y"
           :sitemap-sort-files anti-chronologically
           :sitemap-format-entry x/org-publish-notes-sitemap-entry
           :sitemap-filename ".index.org"
          
           :html-head ,(x/publish-src "head.html")
           :html-preamble t
           :html-postamble t)
          ("posts"
           :base-directory ,(x/org-src "/posts/")
           :base-extension "org"
           :exclude "^\\..+"
           :publishing-directory ,(x/publish-path "/posts/")
           :publishing-function org-html-publish-to-html
          
           ;; sitemap
           :auto-sitemap t
           :sitemap-title "Posts"
           :sitemap-function x/org-publish-sitemap
           :sitemap-date-format "%Y %b %d (%a)"
           :sitemap-sort-files anti-chronologically
           ;; :sitemap-format-entry x/sitemap-entry-format-posts
           :sitemap-format-entry x/org-publish-sitemap-entry-post
           :sitemap-filename ".index.org"
          
           :html-head ,(x/publish-src "head.html")
           :html-preamble t
           :html-postamble t)
          ("projects"
           :base-directory ,(x/org-src "/projects/")
           :base-extension "org"
           :exclude "^\\..+"
           :publishing-directory ,(x/publish-path "/projects/")
           :publishing-function org-html-publish-to-html
          
           ;; sitemap
           :auto-sitemap t
           :sitemap-title "Projects"
           ;:sitemap-function x/org-publish-org-sitemap
           :sitemap-date-format "%a %b %d %Y"
           :sitemap-sort-files anti-chronologically
           ;; :sitemap-format-entry x/sitemap-entry-format-notes
           :sitemap-filename ".index.org"
          
           :html-head ,(x/publish-src "head.html")
           :html-preamble t
           :html-postamble t)
          ("setup"
           :base-directory ,(x/org-src "/setup/")
           :base-extension "org"
           :publishing-directory ,(x/publish-path "/setup/")
           :publishing-function org-html-publish-to-html
          
           ;; sitemap
           :auto-sitemap t
           :sitemap-title "My Setup"
           :sitemap-function x/org-publish-sitemap
           :sitemap-date-format "%a %b %d %Y"
           ;; :sitemap-sort-files anti-chronologically
           :sitemap-format-entry x/org-publish-sitemap-entry-setup
           :sitemap-filename ".index.org"
          
           :html-head ,(x/publish-src "head.html")
           :html-preamble t
           :html-postamble t)
          ("res"
           :base-directory ,(x/org-src "/.publish/dist/")
           :base-extension "css\\|js\\|svg"
           :recursive t
           :publishing-directory ,(x/publish-path "/")
           :publishing-function org-publish-attachment)
  
          ("images"
           :base-directory ,(x/org-src "/img/")
           :base-extension "jpg\\|gif\\|png"
           :publishing-directory ,(x/publish-path "/images/")
           :publishing-function org-publish-attachment)
  
          ("website" :components ("home" "posts" "setup" "images" "res"))))
