spacemacs.org
*** Production Script
:PROPERTIES:
:header-args: :tangle ../.publish/publish.el :mkdirp yes :tangle-mode (identity #o755)
:END:

#+BEGIN_SRC emacs-lisp :noweb yes
  #!/usr/bin/env emacs --script

  (require 'package)
  (package-initialize)
  (require 'org)
  (require 'ox)
  (require 'ox-publish)
  (require 'ox-html)
  (require 'htmlize)

  (setq make-backup-files nil)
  ;(setq debug-on-error t)

  (setq org-confirm-babel-evaluate nil)
  ;; (defun org-babel-execute:yaml (body params) body)
  (setq org-export-allow-bind-keywords t)
  ;; (setq src "~/io/notes/")
  ;; (setq dest "~/Projects/home/source/_posts/")
  (message org-version)
  ;; (message load-path)

  (defvar x/org-publish-root ".build")

  <<org-mode-handy>>

  <<org-mode-vars>>
  <<org-mode-clocking>>
  <<org-mode-todo>>
  <<org-mode-agenda>>
  <<org-mode-archive>>
  <<org-mode-babel>>
  <<org-mode-publishing>>

  (org-publish-project "website" t)
  (kill-buffer)
#+END_SRC
*** Troubleshooting
I experienced an export issue on one of my org files, like [[https://github.com/syl20bnr/spacemacs/issues/6296][this one]]. And the
solution is to recompile the elpa binaries. I have a function for that called
[[*funcs][config/recompile-elpa]].

* Personal Layers

** Config
This is my local layer. Take a look at the [[http://spacemacs.org/doc/LAYERS.html][official document about layers]] to
learn more about it. Mostly for me (at least right now), this is about
=org-mode=.
*** layers
The =layers.el= file.
#+BEGIN_SRC emacs-lisp :tangle .dist/emacs/.spacemacs.d/layers/config/layers.el :mkdirp yes
  (configuration-layer/declare-layers
   '(org))
#+END_SRC

#+RESULTS:
| org |

*** packages
:PROPERTIES:
:header-args: :tangle .dist/emacs/.spacemacs.d/layers/config/packages.el :mkdirp yes
:END:
The =packages.el= file.
**** Package Dependencies.
#+BEGIN_SRC emacs-lisp
#+END_SRC

**** org-mode

The post-init-org
#+BEGIN_SRC emacs-lisp :noweb yes
  (setq config-packages
        '(
          (org :location built-in)
          worf
          solaire-mode
          ))

  (defun config/post-init-org ()
    <<org-mode-vars>>
    <<org-mode-clocking>>
    <<org-mode-todo>>
    <<org-mode-agenda>>
    <<org-mode-capture>>
    <<org-mode-archive>>
    <<org-mode-export>>
    <<org-mode-babel>>
    <<org-mode-publishing>>
    (with-eval-after-load 'org
      (require 'ox-extra)
      (ox-extras-activate '(ignore-headlines)))
    )

  (defun config/init-worf ()
    (use-package worf
      :diminish worf-mode
      :after org)
    )
#+END_SRC

solaire-mode config.
#+BEGIN_SRC emacs-lisp
  (defun config/init-solaire-mode ()
    (use-package solaire-mode
      :config
      ;; brighten buffers (that represent real files)
      (add-hook 'after-change-major-mode-hook #'turn-on-solaire-mode)

      ;; ...if you use auto-revert-mode:
      (add-hook 'after-revert-hook #'turn-on-solaire-mode)

      ;; You can do similar with the minibuffer when it is activated:
      (add-hook 'minibuffer-setup-hook #'solaire-mode-in-minibuffer)

      ;; To enable solaire-mode unconditionally for certain modes:
      (add-hook 'ediff-prepare-buffer-hook #'solaire-mode)
      )
    )
#+END_SRC

*** config
the =config.el= file.
#+BEGIN_SRC emacs-lisp :tangle .dist/emacs/.spacemacs.d/layers/config/config.el :mkdirp yes
  (defvar x/org-publish-root "~/publish")
#+END_SRC
*** funcs
:PROPERTIES:
:header-args: :tangle .dist/emacs/.spacemacs.d/layers/config/funcs.el :mkdirp yes
:END:
This is the =funcs.el= file.

Recompile elpa packages. Found this snippet when org-mode babel was not working
for me after fresh reinstall (of emacs and everything).
#+BEGIN_SRC emacs-lisp
  (defun config/recompile-elpa ()
    "Recompile packages in elpa directory. Useful if you switch
    Emacs versions."
    (interactive)
    (byte-recompile-directory package-user-dir nil t))
#+END_SRC

Save links to org-file, automatically grab the title of the page as the
description.
#+BEGIN_SRC emacs-lisp
  (require 'mm-url)
  (defun get-html-title-from-url (url)
    "Return content in <title> tag."
    (let (x1 x2 (download-buffer (url-retrieve-synchronously url)))
      (save-excursion
        (set-buffer download-buffer)
        (beginning-of-buffer)
        (setq x1 (search-forward "<title>"))
        (search-forward "</title>")
        (setq x2 (search-backward "<"))
        (mm-url-decode-entities-string (buffer-substring-no-properties x1 x2)))))

  (defun x/org-insert-link-with-title ()
    "Insert org link where default description is set to html title."
    (interactive)
    (let* ((url (read-string "URL: "))
           (title (get-html-title-from-url url)))
      (org-insert-link nil url title)))
#+END_SRC

Handy functions for org files.
#+NAME: org-mode-handy
#+BEGIN_SRC emacs-lisp
  (defun org-files/work ()
    (file-expand-wildcards (concat org-directory "/work/*.org"))
    )

  (defun org-files/porject ()
    (file-expand-wildcards (concat org-directory "/projects/*.org"))
    )

  (defun get-string-from-file (filePath)
    "Return filePath's file content."
    (with-temp-buffer
      (insert-file-contents filePath)
      (buffer-string)))

  (defun read-lines (filePath)
    "Return a list of lines of a file at filePath."
    (with-temp-buffer
      (insert-file-contents filePath)
      (split-string (buffer-string) "\n" t)))
#+END_SRC

*** keybindings
:PROPERTIES:
:header-args: :tangle .dist/emacs/.spacemacs.d/layers/config/keybindings.el :mkdirp yes
:END:

Customized keybindings. the =keybindings.el= file.

#+BEGIN_SRC emacs-lisp
  (spacemacs/set-leader-keys-for-major-mode 'org-mode
    "iL" 'x/org-insert-link-with-title)
#+END_SRC


