.dist/src/.spacemacs.d/layers/config/funcs.el

(defun config/recompile-elpa ()
  "Recompile packages in elpa directory. Useful if you switch
  Emacs versions."
  (interactive)
  (byte-recompile-directory package-user-dir nil t))

(require 'mm-url)
(defun get-html-title-from-url (url)
  "Return content in <title> tag."
  (let (x1 x2 (download-buffer (url-retrieve-synchronously url)))
    (save-excursion
      (set-buffer download-buffer)
      (beginning-of-buffer)
      (setq x1 (search-forward "<title>"))
      (search-forward "</title>")
      (setq x2 (search-backward "<"))
      (mm-url-decode-entities-string (buffer-substring-no-properties x1 x2)))))

(defun x/org-insert-link-with-title ()
  "Insert org link where default description is set to html title."
  (interactive)
  (let* ((url (read-string "URL: "))
         (title (get-html-title-from-url url)))
    (org-insert-link nil url title)))

(defun org-files/work ()
  (file-expand-wildcards (concat org-directory "/work/*.org"))
  )

(defun org-files/porject ()
  (file-expand-wildcards (concat org-directory "/projects/*.org"))
  )

(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))

(defun read-lines (filePath)
  "Return a list of lines of a file at filePath."
  (with-temp-buffer
    (insert-file-contents filePath)
    (split-string (buffer-string) "\n" t)))
