.dist/src/.spacemacs.d/layers/config/packages.el
  (with-eval-after-load 'org
    (require 'ox-extra)
    (ox-extras-activate '(ignore-headlines)))
  )

(defun config/init-worf ()
  (use-package worf
    :diminish worf-mode
    :after org)
  )

(defun config/init-solaire-mode ()
  (use-package solaire-mode
    :config
    ;; brighten buffers (that represent real files)
    (add-hook 'after-change-major-mode-hook #'turn-on-solaire-mode)

    ;; ...if you use auto-revert-mode:
    (add-hook 'after-revert-hook #'turn-on-solaire-mode)

    ;; You can do similar with the minibuffer when it is activated:
    (add-hook 'minibuffer-setup-hook #'solaire-mode-in-minibuffer)

    ;; To enable solaire-mode unconditionally for certain modes:
    (add-hook 'ediff-prepare-buffer-hook #'solaire-mode)
    )
  )
